number = int(input("Ведіть число: "))

# Робимо математичні дії ділимо наше число і заокруглюємо до цілого.
number_one= number // 10000             # ведене число ділимо на 10000 і беремо перше число від результату
number_two = (number % 10000) // 1000   # ведене число ділимо на 1000 і беремо перше число від результату
number_three = (number % 1000) // 100   # ведене число ділимо на 100 і беремо перше число від результату
number_four = (number % 100) // 10      # ведене число ділимо на 10 і беремо перше число від результату
number_five = number % 10               # беремо залишок від числа і заокруглюємо його до цілого


result =str(number_five) + str(number_four) + str(number_three) + str(number_two) + str(number_one)
print(result)



